In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('ml-100k/u.data',sep='\t')

In [3]:
data.head()

     0   50  5  881250949
0    0  172  5  881250949
1    0  133  1  881250949
2  196  242  3  881250949
3  186  302  3  891717742
4   22  377  1  878887116

In [6]:
r_cols = ['user_id','size']
data = pd.read_csv('ml-100k/u.data',sep='\t',names=r_cols,usecols=[1,3])
data.head()

   user_id       size
0       50  881250949
1      172  881250949
2      133  881250949
3      242  881250949
4      302  891717742

In [7]:
r_cols = ['user_id', 'movie_id', 'rating']
data = pd.read_csv('ml-100k/u.data',sep='\t',names=r_cols,usecols=range(3))
data.head()

   user_id  movie_id  rating
0        0        50       5
1        0       172       5
2        0       133       1
3      196       242       3
4      186       302       3